app/controllers/comments_controller.rb

  def create

    @comment = Comment.new(params[:comment])
    @idea = Idea.find(params[:idea_id])
    @comment.commentable = @idea
    @comment.user = current_user
    respond_to do |format|
      if @comment.save
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("comment", "commentable_id", "commentable_type", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)