app/controllers/foros_controller.rb

SELECT "foros".* FROM "foros"
---
  def index
    @foros = Foro.all

SELECT "foros".* FROM "foros" WHERE "foros"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @foro = Foro.find(params[:id])

INSERT INTO "comments" ("comment", "commentable_id", "commentable_type", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "foros" ("created_at", "titulo", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 29 Mar 2012 10:11:05 UTC +00:00], ["titulo", ""], ["updated_at", Thu, 29 Mar 2012 10:11:05 UTC +00:00], ["user_id", nil]]
---
  def create
    @foro = Foro.new(params[:foro])
    @foro.user = current_user
    @comment = Comment.new(params[:comment])
    @comment.user = current_user
    @foro.comments << @comment

SELECT "foros".* FROM "foros" WHERE "foros"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "foros" WHERE "foros"."id" = ?  [["id", 1]]
---
  def destroy
    @foro = Foro.find(params[:id])
    @foro.destroy