app/controllers/ideas_controller.rb

  def edit
    @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @idea = Idea.new(params[:idea])
    @idea.user = current_user
    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("alternative", "benefit_statement", "created_at", "differentiation", "need_statement", "product_cat", "product_name", "target", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @idea = Idea.find(params[:id])
    if @idea.user != current_user
      flash[:notice] = "No puedes modificar ideas de otros"
      redirect_to idea_url(@idea)
    end
    @idea.destroy
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]

  def vote_up
    @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]

  def vote_down
    @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]